# 导入库
import matplotlib.pyplot as plt

# 设定画布。dpi越大图越清晰，绘图时间越久
fig = plt.figure(figsize=(4, 4), dpi=300)

# 导入数据
x = [0, 0.5454545454545454, 0.6526, 0.7248062015503876, 0.7471, 0.7821011673151751, 0.8070, 0.8267716535433071, 0.8418,
     0.8714859437751004, 0.9068, 0.9183673469387755, 0.9385, 0.9465020576131687, 0.9473, 0.9473, 0.9473, 0.9473, 1.0]
y = [1, 0.972972972972973, 0.9553, 0.9396984924623115, 0.9320, 0.9348837209302325, 0.9111, 0.9090909090909091, 0.8987,
     0.8714859437751004, 0.8648, 0.8555133079847909, 0.8357, 0.8214285714285714, 0.5318, 0.5284, 0.5284, 0.5284, 0]

# 绘图命令
plt.plot(x, y, lw=4, ls='-', c='b', alpha=0.1)

plt.ylabel('Precision')
plt.xlabel('Recall')

for a, b in zip(x, y):
    plt.text(a, b, b, ha='center', va='bottom', fontsize=2)

plt.plot()

# show出图形
plt.show()
# 保存图片
fig.savefig("pr.jpg")

map = 0
for i in range(1, len(x)):
    map += (x[i]-x[i-1]) * y[i]

print(f"map={map}")
